---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctLiningType
source: html/4586ac5e-f45d-89b0-842f-e66ae617ae30.htm
---
# Autodesk.Revit.DB.Mechanical.DuctLiningType

This class represents a duct lining type in Autodesk Revit.

## Syntax (C#)
```csharp
public class DuctLiningType : ElementType
```